// *********  Fetch  ********* \\

// https://www.postman.com/downloads/
// https://rickandmortyapi.com/documentation

// до ES6 модулів використовувались XMLHttpRequest
// https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequest_API/Using_XMLHttpRequest
// елемент fetch побудований на промісах, проміси це мікротаски і значить фетч піде до eventLoop в розділ до мікротасок

//на сьогоднішній день використовуються fetch запити
// fetch повертає проміс
// щоб його опрацювати і отримати в коді відповідь як показано в devTools-Network-клікнути по запиту - вкладка Preview
// дана відповідь вже перетворена з формату json
// потрібно використовувати ланцюжок then/catch/finally
// в першому then ми не побачимо інформацію так як ми бачимо в Preview
// в першому then приходить об'єкт  Response, в якому видно як відпрацював запит:
// ok: true - статус запиту true\false
// redirected: false - чи відбувався редірект на стороні backend, тобто чи переадресували нас з одного ендпоінта на інший
// statusText: "" - публічні API в більшості не віддають таке повідомлення
// type:'cors' - чи використовується cors policy
// так як спілкування відбувається за допомогою архітектури REST, яка має на меті обмін даними в форматі json,
// то щоб розпарсити відповідь і отримати у вигляді як в Preview, потрібно використати parse метод,
// але не класичний JSON.parse, а використовуючи метод json на об'єкті Response
// прописуємо його в першому then .then(resp=> resp.json())
// даний метод json відпрацьовує лише один раз
// тому код наступного вигляду поверне помилку на рядку return resp.json():
// .then(resp => {console.log(resp.json()); return resp.json()})
// метод resp.json() - поверне нам проміс

fetch('https://rickandmortyapi.com/api/charact')
  .then(resp => {
    console.log(resp);
    if (!resp.ok) {
      throw new Error('custom error log 😒');
    }
    return resp.json();
  })
  .then(data => console.log(data))
  .catch(err => console.log(err));

// ********* Обробка помилок та парсинг відповіді ********* \\

// іноді перед тим як зробити парсинг потрібно "підказати" браузеру як зрозуміти помилку
// це скоріше недопрацювання бекенду, бо іноді там невірно роблять конфігурації
// браузер погано працює з помилками, які пов'язані з 400м, 401(не авторизований), 403, 404м(не знайдено) статусами
// фактично цн
// коли приходить один із таких статусів, можна примусово перевести проміс в статус reject за допомогою
// перевірки статусу ok:false\true із об'єкта Response
// для цього перед результатом парсу вказуємо умову if(!resp.ok){throw new Error}
// яка відбирає falsy значення і за допомогою команди throw перериваємо роботу then і генеруємо самостійно помилку new Error
// throw автоматично перенаправляє в блок catch, де консолимо error
// в new Error, якщо описано на беку передаємо опис помилки через resp.statusText
// або пишемо самі повідомлення з описом помилки

// ********* CORS ********* \\
// в Headers, службова інформація, яку ми передаємо із фронтенда на бекенд (можемо подивитись поруч з Preview)
// є властивість Origin, яку браузер заповнює сам, бере її з нашого url
// fetch('https://common-api.rozetka.com.ua/v2/fat-menu/full?front-type=xl&country=UA&lang=ua&r=0.7297302207424572')
// на сайті розетки ця властивість Origin містить https://rozetka.com.ua
// браузер таким чином перевіряє чи є в умовному білому списку бекенду url з якого робиться запит і
// чи можна віддавати відповідь(дані) тому ресурсу, таким чином відбувається
// при цьому використання запиту в Postman https://common-api.rozetka.com.ua/v2/fat-menu/full?front-type=xl&country=UA&lang=ua&r=0.7297302207424572'
// віддасть дані з бекенду, бо Postman це не браузер і в ньому немає тої нативної поведінки додавати властивість Origin
// тому бекенд не розуміє, що можна тому ресурсу як Postman віддати дані

// *************** ПРАКТИКА *************** \\

// Потрібно створити функціонал для отримання прогнозу погоди в місті.
// Використай публічне API https://www.weatherapi.com/docs/
// Використовуй ендпоінт Forecast для того, щоб отримати прогноз погоди на декілька днів.
