let x = 5;
let y = 3;

// x += 5; //те саме що x = x + 5;
// x -= 2; //те саме що x = x - 2;
// x *= 3; //те саме що x = x * 3;
// x /= 5; //те саме що x = x / 5;

// x += 1; // те саме що x++ // те саме що ++x

// x++ - операція інкременту(збільшення) з постфіксним типом запису
// ++x - операція інкременту з префіксним типом запису

y = x++; //5 - тому що при постфіксному типу запису інкремент йде після присвоєння, тобто спочатку y-ку присвоється
// значення x, тобто 5
y = ++x; //6 - тому що при префіксному типу запису спочатку йде інкремент x, тобто x стає 6, а потім значення x присвоюється y,
// тобто y буде 6

// x -= 1; // те саме що x-- // те саме що --x

// console.log(x);
// console.log(y);



